# 1 день; +27 задача; всего: 27
# Напишите программу для нахождения цифр четырёхзначного числа.
x = int(input())
a = (x // 1000)
b = ((x // 100) % 10)
c = ((x // 10) % 10)
d = (x % 10)

print(f'Цифра в позиции тысяч равна {a}\nЦифра в позиции сотен равна {b}\nЦифра в позиции десятков равна {c}\nЦифра в позиции единиц равна {d}')
