# 1 день; +26 задача; всего: 26
# Напишите программу, в которую вводится трёхзначное число и которая выводит на экран его цифры (через запятую).

x = int(input())
a = (x // 100)
b = ((x // 10) % 10)
c = (x % 10)

print(f'{a}{b}{c}\n{a}{c}{b}\n{b}{a}{c}\n{b}{c}{a}\n{c}{a}{b}\n{c}{b}{a}\n')
